Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Developing with Flyway
ja_jp: Flywayを使った開発

source: Development Mode
ja_jp: 開発モード

source: Development Tools
ja_jp: 開発ツール

source: Development mailing list
ja_jp: 開発メーリングリスト

source: Development mode
ja_jp: 開発モード

source: Development of our platform started over 3 years ago. Quarkus was barely a rumbling, Kogito wasn't even a thing yet, and I managed to slip in the middle name "Jenkins" for my son because it was still a popular build system.
ja_jp: 私たちのプラットフォームの開発は、3年以上前に始まりました。Quarkusはまだ鳴り物入りで、Kogitoはまだ存在していませんでした。また、息子のミドルネームに「Jenkins」を入れたのは、Jenkinsがまだ人気のあるビルドシステムだったからです。

source: Development-centric experience without compromises to bring your amazing applications to life in no time
ja_jp: 妥協のない開発中心の体験で、素晴らしいアプリケーションを短時間で実現

source: Did we mention that you will get some pretty cool swag too?
ja_jp: また、素敵なグッズがもらえることもお伝えしましたか？

source: Diff
ja_jp: 差分

source: Differences Between `GeneratedResourceBuildItem` and `GeneratedStaticResourceBuildItem`
ja_jp: `GeneratedResourceBuildItem` と `GeneratedStaticResourceBuildItem` の違い

source: Differences between virtual threads and platform threads
ja_jp: 仮想スレッドとプラットフォームスレッドの違い

source: Differences with the Micrometer API
ja_jp: Micrometer API との相違点

source: Differences with vanilla JAX-RS
ja_jp: バニラ JAX-RS との違い

source: Differences with vanilla Jakarta REST
ja_jp: 素のJakarta RESTとの差異

source: Different `MATCHING_RESOURCES` scoped test resources are being used
ja_jp: 異なる `MATCHING_RESOURCES` スコープのテストリソースが使用されている

source: Different configuration sources are loaded in the following order of precedence, from the least important to the highest:
ja_jp: さまざまな設定ソースは、重要度の最も低いものから最も高いものの順に、次の優先順序で読み込まれます。

source: Different entry command for each profile
ja_jp: プロファイルごとに異なるエントリーコマンド

source: Different gRPC implementations / types
ja_jp: 異なるgRPCの実装/タイプ

source: Different persistence units can use different storage engines.
ja_jp: 永続化ユニットごとに異なるストレージエンジンを使用できます。

source: Dimensional labels are added for the request uri, the HTTP method (GET, POST, etc.), the status code (200, 302, 404, etc.), and a more general outcome field. You should find something like this:
ja_jp: リクエスト URI、HTTP メソッド (GET、POST など)、ステータスコード (200、302、404 など)、一般的な結果フィールドにディメンションラベルが追加されます。次のようなものが見つかるはずです。

source: Direct Quarkus extension dependencies managed by the `quarkus-bom`
ja_jp: `quarkus-bom` によって管理される直接的な Quarkus エクステンションの依存関係

source: Direct Quarkus extension dependencies managed by the `quarkus-camel-bom`
ja_jp: `quarkus-camel-bom` によって管理される直接的な Quarkus エクステンションの依存関係

source: Direct Quarkus extension dependencies managed by the `quarkus-kogito-bom`
ja_jp: `quarkus-kogito-bom` によって管理される直接的な Quarkus エクステンションの依存関係

source: Direct Quarkus extensions dependencies that aren't managed by Quarkus BOMs but found in the Quarkus extension registry
ja_jp: Quarkus BOM によって管理されていないが、Quarkus 拡張レジストリーにある直接的な Quarkus 拡張の依存関係

source: Direct configuration
ja_jp: 直接設定

source: Direct dependencies on other extensions
ja_jp: 他のエクステンションへの直接の依存関係

source: Directions in this article will not work on macOS and Microsoft Windows.
ja_jp: この記事に記載されている方法は、macOSおよびMicrosoft Windowsでは使用できません。

source: Directly in your code via `io.quarkus.qute.i18n.MessageBundles#get()`; e.g. `MessageBundles.get(AppMessages.class).hello_name("Lucie")`
ja_jp: `io.quarkus.qute.i18n.MessageBundles#get()` を経由し、直接コードの中で使用。例: `MessageBundles.get(AppMessages.class).hello_name("Lucie")`

source: Directory Structure
ja_jp: ディレクトリ構造

source: Dirty: dirty pages (both shared and private) in kilobytes
ja_jp: Dirty: ダーティーページ (共有とプライベートの両方)、キロバイト単位。

source: Disable Dev Services for Keycloak
ja_jp: Dev Services for Keycloak を無効にする

source: Disable Elasticsearch version checks on startup by setting the configuration property <<quarkus-hibernate-search-orm-elasticsearch_quarkus-hibernate-search-orm-elasticsearch-version-check-enabled,`quarkus.hibernate-search-orm.elasticsearch.version-check.enabled`>> to `false`.
ja_jp: 設定プロパティー <<quarkus-hibernate-search-orm-elasticsearch_quarkus-hibernate-search-orm-elasticsearch-version-check-enabled,`quarkus.hibernate-search-orm.elasticsearch.version-check.enabled`>> を `false` に設定して、 起動時の Elasticsearch バージョンチェックを無効にします。

source: Disable Elasticsearch version checks on startup by setting the configuration property <<quarkus-hibernate-search-standalone-elasticsearch_quarkus-hibernate-search-standalone-elasticsearch-version-check-enabled,`quarkus.hibernate-search-standalone.elasticsearch.version-check.enabled`>> to `false`.
ja_jp: 設定プロパティー <<quarkus-hibernate-search-standalone-elasticsearch_quarkus-hibernate-search-standalone-elasticsearch-version-check-enabled,`quarkus.hibernate-search-standalone.elasticsearch.version-check.enabled`>> を `false` に設定して、 起動時の Elasticsearch バージョンチェックを無効にします。

source: Disable Elasticsearch version checks on startup by setting the configuration property link:#quarkus-hibernate-search-orm-elasticsearch_quarkus.hibernate-search-orm.elasticsearch.version-check.enabled[`quarkus.hibernate-search-orm.elasticsearch.version-check.enabled`] to `false`.
ja_jp: 起動時にElasticsearchのバージョンチェックを行わないようにするには、設定プロパティ link:#quarkus-hibernate-search-orm-elasticsearch_quarkus.hibernate-search-orm.elasticsearch.version-check.enabled[`quarkus.hibernate-search-orm.elasticsearch.version-check.enabled`] を `false` に設定します。

source: Disable HTTPS
ja_jp: HTTPS の無効化

source: Disable Isolates
ja_jp: 分離の無効化

source: Disable JSON logging in application.properties for dev and test mode
ja_jp: application.properties で dev および test モードに対する JSONロギングを無効にする

source: Disable JSON logging in application.properties for dev and test mode:
ja_jp: 開発モードおよびテストモードで application.properties の JSON ロギングを無効にします。

source: Disable `Allow File Browsing`;
ja_jp: `Allow File Browsing` を無効化。

source: Disable `Download Remote Indexes`;
ja_jp: `Download Remote Indexes` を無効化。

source: Disable `Include in Search`.
ja_jp: `Include in Search` の無効化。

source: Disable all or parts of the OpenTelemetry extension
ja_jp: OpenTelemetry エクステンション全体または一部を無効にする

source: Disable at Runtime
ja_jp: 実行時に無効化

source: Disable auto-registration of all Service Loader implementations
ja_jp: すべてのサービスローダー実装の自動登録を無効にする

source: Disable fallback images
ja_jp: フォールバックイメージの無効化

source: Disable metrics
ja_jp: メトリクスの無効か

source: Disable metrics collection
ja_jp: メトリクスの収集の無効化

source: Disable parts of the automatic tracing
ja_jp: 自動トレースの一部を無効にする

source: Disable preloading
ja_jp: プリローディングの無効化

source: Disable proactive authentication so that the `@AuthenticationContext` annotation can be matched with the endpoint before Quarkus authenticates incoming requests.
ja_jp: Quarkus が受信リクエストを認証する前に、 `@AuthenticationContext` アノテーションをエンドポイントに一致させることができるように、プロアクティブ認証を無効にします。

source: Disable running of integration tests (test names `*IT` and annotated with `@QuarkusIntegrationTest`) on all builds. To run these tests all the time, either remove this property, set its value to `false`, or set `-DskipITs=false` on the command line when you run the build. + As mentioned below, this is overridden in the `native` profile.
ja_jp: すべてのビルドで統合テストの実行を無効にします (テスト名は `*IT` で、 `@QuarkusIntegrationTest` のアノテーションが付けられています)。これらのテストを常に実行するには、このプロパティーを削除するか、値を `false` に設定するか、ビルドを実行するときにコマンドラインで `-DskipITs=false` を設定します。+ 後述するように、これは `native` プロファイルでオーバーライドされます。

source: Disable schema generation, because it is not supported by Hibernate ORM for database multi-tenancy. We'll use Flyway instead, see further down.
ja_jp: データベースのマルチテナンシーには Hibernate ORM によるスキーマ生成がサポートされていないため、スキーマ生成を無効にします。代わりに Flyway を使用します。詳細は下記を参照してください。

source: Disable schema generation, because it is not supported by Hibernate ORM for schema multi-tenancy. We'll use Flyway instead, see further down.
ja_jp: スキーママルチテナンシーでは Hibernate ORM によってサポートされていないため、スキーマ生成を無効にします。 代わりに Flyway を使用します。詳細は下記を参照してください。

source: Disable schema management on startup by setting the configuration property <<quarkus-hibernate-search-orm-elasticsearch_quarkus-hibernate-search-orm-schema-management-strategy,`quarkus.hibernate-search-orm.schema-management.strategy`>> to `none`.
ja_jp: 設定プロパティー <<quarkus-hibernate-search-orm-elasticsearch_quarkus-hibernate-search-orm-schema-management-strategy,`quarkus.hibernate-search-orm.schema-management.strategy`>> を `none` に設定して、 起動時にスキーマ管理を無効にします。

source: Disable schema management on startup by setting the configuration property <<quarkus-hibernate-search-standalone-elasticsearch_quarkus-hibernate-search-standalone-schema-management-strategy,`quarkus.hibernate-search-standalone.schema-management.strategy`>> to `none`.
ja_jp: 設定プロパティー <<quarkus-hibernate-search-standalone-elasticsearch_quarkus-hibernate-search-standalone-schema-management-strategy,`quarkus.hibernate-search-standalone.schema-management.strategy`>> を `none` に設定して、 起動時にスキーマ管理を無効にします。

source: Disable schema management on startup by setting the configuration property link:#quarkus-hibernate-search-orm-elasticsearch_quarkus.hibernate-search-orm.schema-management.strategy[`quarkus.hibernate-search-orm.schema-management.strategy`] to `none`.
ja_jp: 設定プロパティ link:#quarkus-hibernate-search-orm-elasticsearch_quarkus.hibernate-search-orm.schema-management.strategy[`quarkus.hibernate-search-orm.schema-management.strategy`]を `none` に設定すると起動時のスキーマ管理を無効にすることができます。

source: Disable the HTTP port
ja_jp: HTTP ポートの無効化

source: Disable tracing for the `/people` URI and all subpaths, such as `/people/1` and `/people/1/cars`.
ja_jp: `/people` URI と、 `/people/1` や `/people/1/cars` などのすべてのサブパスのトレーシングを無効にします。

source: Disable tracing for the `/ping` URI.
ja_jp: `/ping` URI のトレーシングを無効にします。

source: Disable tracing for the `/trace` URI.
ja_jp: `/trace` URI のトレーシングを無効にします。

source: Disable via `-H:-SpawnIsolates`.
ja_jp: `-H:-SpawnIsolates` で無効化します。

source: Disables TLS verification for development purposes, not recommended for production.
ja_jp: 開発目的で TLS 検証を無効にします。実稼働環境では推奨されません。

source: Disables ssl host name validation
ja_jp: sslホスト名の検証を無効にします。

source: Disables support for all monitoring options that would be enabled by default in Quarkus
ja_jp: Quarkus でデフォルトで有効になるすべてのモニタリングオプションのサポートを無効化

source: Disables the plain HTTP protocol, requiring all requests to use HTTPS. When you set `quarkus.http.ssl.client-auth` to `required`, `quarkus.http.insecure-requests` is automatically disabled.
ja_jp: プレーン HTTP プロトコルを無効にし、すべてのリクエストで HTTPS を使用するように要求します。 `quarkus.http.ssl.client-auth` を `required` に設定すると、 `quarkus.http.insecure-requests` が自動的に無効になります。

source: Disabling
ja_jp: 無効化

source: Disabling ALPN is not recommended for non-experts, as it can lead to performance degradation, protocol negotiation issues, and unexpected behavior, particularly with protocols like HTTP/2. However, disabling ALPN can be useful for diagnosing native inconsistencies or testing performance in specific edge cases where protocol negotiation causes conflicts.
ja_jp: ALPN を無効にすることは、エキスパート以外には推奨されません。特に HTTP/2 などのプロトコルで、パフォーマンスの低下、プロトコルネゴシエーションの問題、予期しない動作が発生する可能性があるためです。 ただし、ALPN の無効化は、プロトコルネゴシエーションによって競合が発生する特殊なケースで、固有の不整合を診断したり、パフォーマンスをテストしたりするのに役立ちます。

source: Disabling Authorization
ja_jp: 認可の無効化

source: Disabling Dev Services
ja_jp: Dev Servicesの無効化

source: Disabling Hostname Verification
ja_jp: ホスト名の検証を無効にする

source: Disabling SSL verifications
ja_jp: SSL の検証の無効化

source: Disabling Specific Traces for Application Endpoints
ja_jp: アプリケーションエンドポイントの特定のトレースを無効にする

source: Disabling Tenant Configurations
ja_jp: テナント設定を無効にする

source: Disabling a policy check using a Keycloak Authorization Policy such as:
ja_jp: 以下のようなKeycloak Authorization Policyを使ったポリシーチェックを無効にします。

source: Disabling a registry in the configuration
ja_jp: 設定でレジストリを無効化

source: Disabling metrics collection
ja_jp: メトリクス収集の無効化

source: Disabling optimizations makes it easier to learn how to use `perf` and get as detailed stack traces as possible, because it shows more info about what gets called where. However, doing so might lead to more allocations happening which would not happen if optimizations would have been applied. In other words, passing in `-O0` will change the allocation pattens for many applications, because it disables optimizations such as escape analysis or dead code elimination. To properly assess the allocations made by an application deployed in production, run with default optimizations (`-O2`). With default optimizations the stack traces obtained with `perf` maybe be harder to decipher.
ja_jp: 最適化を無効にすると、 `perf` の使い方を学びやすくなり、スタックトレースをできるだけ詳細に取得することができます。これは、何がどこで呼び出されるのかについてより多くの情報を示すためです。しかし、そうすることで、最適化が適用されていれば起こらないような、より多くのアロケーションが発生する可能性があります。言い換えれば、 `-O0` を渡すと、エスケープ分析やデッドコード除去などの最適化が無効になるため、多くのアプリケーションでアロケーションパターンが変化します。本番環境に導入されたアプリケーションのアロケーションを適切に評価するには、デフォルトの最適化( `-O2` )で実行します。デフォルトの最適化では、 `perf` で得られたスタックトレースを解読するのは難しいかもしれません。

source: Disabling permissions
ja_jp: 権限の無効化

source: Disabling tenant configurations
ja_jp: テナント設定を無効にする

source: Disabling the default mapper
ja_jp: デフォルトマッパーを無効にする

source: Disabling the feature
ja_jp: 機能の無効化

source: Disclaimer
ja_jp: 免責事項

source: Discover Camel, the swiss-knife of integration brought to Quarkus. The example encourages API best practices, with effortless coding effort showcasing AtlasMap for data transformation.
ja_jp: Quarkusに導入されたインテグレーションのスイス・アーミーナイフ、Camelを発見してください。この例では、データ変換用のAtlasMapを紹介する簡単なコーディング作業で、APIのベストプラクティスを奨励しています。

source: Discover Maven goals
ja_jp: Mavenのゴールの発見

source: Discover Quarkus world in Japanese
ja_jp: Quarkusワールドを日本語で探索

source: Discover how to create your first Quarkus application.
ja_jp: 初めてのQuarkusアプリケーションを作成する方法をご紹介します。

source: Discover how to develop highly scalable REST services with JAX-RS and RESTEasy Reactive.
ja_jp: JAX-RSとRESTEasyReactiveを使用して高度にスケーラブルなリアクティブRESTサービスを開発する方法を説明します。

source: Discover how to develop highly scalable reactive REST services with JAX-RS and RESTEasy Reactive.
ja_jp: JAX-RSとRESTEasyReactiveを使用して拡張性の高いリアクティブRESTサービスを開発する方法を説明します。

source: Discover how to develop highly scalable reactive REST services with Jakarta REST and Quarkus REST.
ja_jp: Jakarta REST と Quarkus REST を使用して、スケーラビリティの高いリアクティブ REST サービスを開発する方法を紹介します。

source: Discover how to develop highly scalable reactive REST services with Jakarta REST and RESTEasy Reactive.
ja_jp: Jakarta RESTとRESTEasy Reactiveを使用して、スケーラブルなリアクティブなRESTサービスを開発する方法を紹介します。

source: Discover how to secure application HTTP endpoints by using the Quarkus OpenID Connect (OIDC) authorization code flow mechanism with the Quarkus OIDC extension, providing robust authentication and authorization.
ja_jp: Quarkus OIDCエクステンションでQuarkus OpenID Connect（OIDC）の認可コードフローメカニズムを使用して、アプリケーションのHTTPエンドポイントを保護し、堅牢な認証と認可を実現する方法をご覧ください。

source: Discover how you can streamline the release process of your Quarkus applications with JReleaser.
ja_jp: JReleaserでQuarkusアプリケーションのリリースプロセスを合理化する方法を説明します。

source: Discover some of the features that make developing with Quarkus a joyful experience.
ja_jp: Quarkusでの開発を楽しくする機能のいくつかをご覧ください。

source: Discover the Mutiny variant of the Vert.x API
ja_jp: Vert.x API の Mutiny版について

source: Discovered value
ja_jp: 検出された値

source: Discovering Reactive SQL Clients In Quarkus
ja_jp: Quarkus での反応型 SQL クライアントの発見

source: Discovering already started Compose Services
ja_jp: 既に起動している Compose Services の検出

source: Discovery and selection
ja_jp: ディスカバリーとセレクション

source: Discovery path
ja_jp: ディスカバリーパス

source: Discuss the development of Quarkus with the team in the <a href="mailto:quarkus-dev+subscribe@googlegroups.com">development mailing list </a> or by <a href="https://quarkusio.zulipchat.com/" target="blank">Zulip Chat</a>.
ja_jp: Quarkus の開発については、<a href="mailto:quarkus-dev+subscribe@googlegroups.com">開発メーリングリスト</a>または <a href="https://quarkusio.zulipchat.com/" target="blank">Zulip チャット</a>でチームと議論してください。

source: Discuss with us on https://quarkusio.zulipchat.com/[Zulip] and on the https://groups.google.com/d/forum/quarkus-dev[mailing list].
ja_jp: https://quarkusio.zulipchat.com/[Zulip] や https://groups.google.com/d/forum/quarkus-dev[メーリングリスト] でディスカッションに参加

source: Discussion about Quarkus
ja_jp: Quarkusについてディスカッション

source: Discussions
ja_jp: ディスカッション

source: Discussions and Collaboration
ja_jp: 議論とコラボレーション

source: Disk footprint icon
ja_jp: ディスクフットプリントのアイコン

source: Dispatching strategy
ja_jp: ディスパッチ戦略

source: Display
ja_jp: 表示

source: Display a code block. This component is aware of the theme and will use the correct codemirror theme to match the light/dark mode.
ja_jp: コードブロックを表示します。このコンポーネントはテーマを認識し、ライト/ダークモードに合わせて適切な codemirror テーマを使用します。

source: Display gRPC CLI help:
ja_jp: gRPC CLI ヘルプを表示：

source: Display some build time data on a screen (without having to do frontend coding):
ja_jp: ビルド時データを画面に表示します (フロントエンドのコーディングは不要)。

source: Display the cache and content with the Infinispan Server Console
ja_jp: Infinispan Server Consoleでキャッシュとコンテンツを表示

source: Display the list of pods associated with your current OpenShift project:
ja_jp: 現在の OpenShift プロジェクトに関連付けられたポッドのリストを表示します：

source: Displaying a Greeting Message
ja_jp: 挨拶のメッセージを表示

source: Displays all Quarkus extensions (used by the current application) as cards. Each card may provide configuration, documentation, or tools.
ja_jp: すべての Quarkus エクステンション (現在のアプリケーションで使用されているもの) をカードとして表示します。各カードは、設定、ドキュメント、またはツールを提供する場合があります。

source: Displays information about automatically started services (e.g., databases, Kafka brokers).
ja_jp: 自動的に開始されたサービス (例: データベース、Kafka ブローカー) に関する情報を表示します。

source: Distinguish between root and duplicated contexts
ja_jp: ルート・コンテキストと複製コンテキストの区別

source: Distinguish dev/test vs. prod when pre-loading
ja_jp: プリロード時の開発/テストと実稼働の区別

source: Distributed transactions
ja_jp: 分散型トランザクション

source: Distribution SBOMs
ja_jp: ディストリビューション SBOM

source: Distribution summaries are populated by calling the `record` method to record observed values, while timers provide additional capabilities specific to working with time and measuring durations. For example, we can use a timer to measure how long it takes to calculate prime numbers using one of the `record` methods that wraps the invocation of a Supplier function:
ja_jp: ディストリビューション・サマリーは、 `record` メソッドを呼び出して観測値を記録することで入力されます。一方、タイマーは、時間の扱いや持続時間の測定に特化した追加機能を提供します。例えば、タイマーを使って、Supplier関数の呼び出しをラップする `record` メソッドの1つを使って、素数の計算にかかる時間を測定することができます。

source: DistributionSummary with SLOs
ja_jp: SLO による分布サマリー

source: Distroless image support is experimental.
ja_jp: Distroless イメージのサポートは実験的なものです。

source: Distroless images should not be used in production without rigorous testing.
ja_jp: Distroless イメージを本番環境で使用する場合は、必ず厳密なテストを実施してください。

source: Dive into using Java and AI
ja_jp: JavaとAIの活用を深掘りする

source: Diátaxis documentation framework
ja_jp: Diátaxis ドキュメントフレームワーク

source: Do I Need Native Images?
ja_jp: ネイティブイメージは必要ですか？

source: Do I have to use the new RESTEasy Reactive APIs to achieve maximum performance?
ja_jp: 最大のパフォーマンスを実現するためには、新しい RESTEasy Reactive API を使用する必要がありますか?

source: Do as much initialization as much as possible statically. This avoid runtime overhead.
ja_jp: 可能な限り多くの初期化を静的に実行します。 これにより、実行時のオーバーヘッドを回避できます。

source: Do not add any scopes on the next page, and press `SAVE AND CONTINUE`:
ja_jp: 次のページにスコープを追加せずに、 `SAVE AND CONTINUE` を押します。

source: Do not add any test user on the next page, and press `SAVE AND CONTINUE`:
ja_jp: 次のページにテストユーザーを追加せずに、 `SAVE AND CONTINUE` を押します。

source: Do not allow access to the `http://localhost:8080/protected` endpoint if the GitHub access token does not have a `user:email` scope. Please note that while the `PermissionBasedAuthorization` capability to constrain access tokens is great, applying it in the context of this application is not necessary: authorization code flow access tokens, and GitHub access tokens in particular, are not meant to control access to the application that acquired them but for this application to use them on behalf of the authenticated user to access another API, such as GitHub API, as indeed, is demonsrtated below.
ja_jp: GitHub アクセストークンに `user:email` スコープがない場合、 `http://localhost:8080/protected` エンドポイントへのアクセスを許可しないでください。アクセストークンを制限する `PermissionBasedAuthorization` 機能は優れていますが、このアプリケーションのコンテキストで適用する必要はないことに注意してください。認可コードフローのアクセストークン、特に GitHub のアクセストークンは、それを取得したアプリケーションへのアクセスを制御するためのものではなく、認証されたユーザーに代わって GitHub API などの別の API にアクセスするためにそのアプリケーションが使用するためのものです。これについては後述の実演で説明します。

source: Do not change the handler switch. This must be hardcoded to `io.quarkus.amazon.lambda.runtime.QuarkusStreamHandler::handleRequest`. This handler bootstraps Quarkus and wraps your actual handler so that injection can be performed.
ja_jp: ハンドラースイッチを変更しないでください。これは、 `io.quarkus.amazon.lambda.runtime.QuarkusStreamHandler::handleRequest` にハードコードする必要があります。このハンドラは、Quarkusをブートストラップし、インジェクションを実行できるように実際のハンドラをラップします。

source: Do not change the handler switch. This must be hardcoded to `io.quarkus.funqy.lambda.FunqyStreamHandler::handleRequest`. This special handler is Funqy's integration point with AWS Lambda.
ja_jp: ハンドラースイッチを変更しないでください。これは `io.quarkus.funqy.lambda.FunqyStreamHandler::handleRequest` にハードコードされている必要があります。この特別なハンドラーは、Funqy と AWS Lambda の統合ポイントです。

source: Do not forget to add the native transport dependency. See <<native-transport>> for details.
ja_jp: ネイティブのトランスポート依存関係を追加することを忘れないでください。 詳細については、<<native-transport>> を参照してください。

source: Do not forget to add the native transport dependency. See xref:native-transport[Use native transports] for details.
ja_jp: ネイティブ・トランスポートの依存関係を追加することを忘れないでください。 詳細は xref:native-transport[ネイティブ・トランスポートの使用] を参照してください。

source: Do not forget to install at least one extension that provides an `IdentityProvider` based on selected authentication requirements. Please refer to the xref:security-basic-authentication-howto.adoc[Basic authentication guide] for example how to provide the `IdentityProvider` based on username and password.
ja_jp: 選択した認証要件に応じた `IdentityProvider` を提供するエクステンションを、必ず 1 つ以上インストールします。 ユーザー名とパスワードに基づいて `IdentityProvider` を提供する方法の例については、xref:security-basic-authentication-howto.adoc[Basic 認証ガイド] を参照してください。

source: Do not include any Log4j dependencies because the `log4j2-jboss-logmanager` library contains all that is needed to use Log4j as a logging implementation.
ja_jp: `log4j2-jboss-logmanager` ライブラリには、ロギング実装としてLog4jを使用するために必要なものがすべて含まれているため、Log4jの依存関係を含めないでください。

source: Do not include any Log4j dependencies, as the `log4j2-jboss-logmanager` library contains everything needed to use Log4j as a logging implementation.
ja_jp: `log4j2-jboss-logmanager` ライブラリーには、Log4j をロギング実装として使用するために必要なものがすべて含まれているため、Log4j の依存関係を含めないでください。

source: Do not include any Log4j dependencies. The `log4j2-jboss-logmanager` library includes what's needed to use Log4j as a logging facade.
ja_jp: Log4jの依存関係を含めないでください。 `log4j2-jboss-logmanager` ライブラリは、Log4j をロギング・ファサードとして使用するために必要なものを含んでいます。

source: Do not inject a `DataSource` or `AgroalDatasource` directly. Injecting inactive beans causes a startup failure. Instead, inject `InjectableInstance<DataSource>` or `InjectableInstance<AgroalDataSource>`.
ja_jp: `DataSource` や `AgroalDatasource` を直接注入しないでください。非アクティブなBeanを注入すると、起動に失敗します。 代わりに `InjectableInstance<DataSource>` または `InjectableInstance<AgroalDataSource>` を注入します。

source: Do not inject a `Session` directly. Injecting inactive beans causes a startup failure. Instead, inject `InjectableInstance<Session>`.
ja_jp: `Session` を直接注入しないでください。非アクティブな Bean を注入すると起動に失敗します。代わりに `InjectableInstance<Session>` を注入してください。

source: Do not mix <<persistence-xml,`persistence.xml`>> and `quarkus.hibernate-orm.*` properties in `{config-file}`. Quarkus will raise an exception. Make up your mind on which approach you want to use.
ja_jp: `{config-file}` 内で <<persistence-xml,`persistence.xml`>> と `quarkus.hibernate-orm.*` プロパティーを混在させないでください。 Quarkus は例外をスローします。 どちらの方法を採用するか決めてください。
